Pandas merupakan salah satu package yang sangat membantu kita dalam pengolahan data dengan bahasa python. Hal ini karena pandas menyediakan fitur dataframe. Dengan dataframe, kita bisa menjadikan file terbaca menjadi sebuah tabel. File yang didukung seperti .txt, .csv, .tsv dan lainnya.

## Mengimpor Pandas

In [31]:
import pandas as pd

## Import .txt

In [32]:
file1=pd.read_csv("file.txt")
print(file1)

   A\tB
0  1\t4
1  3\t5
2  4\t2

In [33]:
file2=pd.read_csv("file.txt", delimiter="\t")
print(file2)

   A  B
0  1  4
1  3  5
2  4  2

In [34]:
file3=pd.read_csv("file1.txt")
print(file3)

      A\tB
0     1\t2
1     4\t7
2     5\t1
3     6\t3
4     3\t5
5     9\t4
6     2\t7
7     3\t6
8     5\t9
9     4\t8
10    2\t5
11  4\t5\t

In [35]:
file4=pd.read_csv("file1.txt", delimiter="\s+")
print(file4)

    A  B
0   1  2
1   4  7
2   5  1
3   6  3
4   3  5
5   9  4
6   2  7
7   3  6
8   5  9
9   4  8
10  2  5
11  4  5

## Import .csv

In [36]:
file5=pd.read_csv("file.csv")
print(file5)

   A  B
0  1  4
1  3  5
2  4  2

## Import .xlsx

In [37]:
file6=pd.read_excel('file.xlsx')
print(file6)

   A  B
0  1  4
1  3  5
2  4  2

## Import .xls

In [38]:
file7=pd.read_excel('file.xls')
print(file7)

   A  B
0  1  4
1  3  5
2  4  2

## Melihat Tabel

In [39]:
#semua
file2

   A  B
0  1  4
1  3  5
2  4  2

In [40]:
#semua
file4

    A  B
0   1  2
1   4  7
2   5  1
3   6  3
4   3  5
5   9  4
6   2  7
7   3  6
8   5  9
9   4  8
10  2  5
11  4  5

In [41]:
#sebagian yang di atas
file2.head()

   A  B
0  1  4
1  3  5
2  4  2

In [42]:
#sebagian yang di atas
file4.head()

   A  B
0  1  2
1  4  7
2  5  1
3  6  3
4  3  5

## Membuat Dataframe Sendiri

In [43]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [44]:
data = [5,3,7,2,4,9,1]
df1 = pd.DataFrame(data)
print(df1)

   0
0  5
1  3
2  7
3  2
4  4
5  9
6  1

In [45]:
data = [['Silva',19],['Annisa',21],['Hijria',20]]
df2 = pd.DataFrame(data,columns=['Nama','Usia'])
print(df2)

     Nama  Usia
0   Silva    19
1  Annisa    21
2  Hijria    20